Repository: Srcfount/MPT5
Catalog: Locale/*/MPT5fa.po
Languages: fa

source: File
fa: فایل

source: New
fa: جدید

source: Open...
fa: بازکن...

source: Save
fa: ذخیره

source: Save As...
fa: ذخیره بعنوان...

source: Close
fa: بستن

source: Edit
fa: ویرایش

source: Cut
fa: برش

source: Copy
fa: کپی

source: Paste
fa: چسباندن

source: Select All
fa: انتخاب همه

source: Add
fa: اضافه

source: line-close
fa: کد-بستن

source: add close code to button function
fa: اضافه کردن کد بستن به دکمه

source: line-getdata
fa: کد-گرفتن داده ها

source: get data from fields textctrl
fa: گرفتن داده ها از فیلد کنترل متن

source: line-putdata
fa: کد-قرار دادن داده ها

source: put data to fields textctrl
fa: قرار دادن داده ها در فیلد کنترل متن

source: line-fillnull
fa: کد-خالی کردن

source: fill empty record in all data
fa: خالی کردن فیلد از داده ها

source: MLA Utility(Y select)
fa: Import Axes 3D

source: Do you like to save change
fa: آیا میخواهید تغییرات ثبت شود؟

source: Please work in this file or close it then use new file
fa: لطفا قبل از ایجاد فایل جدید این فایل را ببندید

source: Open a file
fa: بازکردن یک فایل

source: Save new file
fa: ذخیره فایل جدید

source: You save to file change successful.
fa: شما فایل را با موفقیت ذخیره کردید

source: Save As new file
fa: ذخیره به عنوان یک فایل جدید

source: No any part of Panel for get data! Please use one of this object: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox
fa: هیچ بخشی از پانل برای دریافت داده وجود ندارد! لطفاً از یکی از این شیء استفاده کنید: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox

source: No any part of Panel for Put data! Please use one of this object: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox wx.RadioButton
fa: هیچ بخشی از پانل برای دریافت داده وجود ندارد! لطفاً از یکی از این شیء استفاده کنید: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox

source: No any part of Panel for Put data! Please use one of this object: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox
fa: هیچ بخشی از پانل برای دریافت داده وجود ندارد! لطفاً از یکی از این شیء استفاده کنید: wx.TextCtrl wx.Choice wx.CheckBox wx.RadioBox

source: List of Panes:
fa: لیست پنل ها:

source: Name Pane
fa: نام پنل

source: Delete
fa: حذف

source: Show
fa: نمایش

source: Update
fa: بروز زسانی

source: Info
fa: اطلاعات

source: Apply
fa: اجراء

source: Pane Info:
fa: اطلاعات پنل:

source: Access
fa: دسترسی

source: Name
fa: نام

source: Caption
fa: عنوان

source: Setting
fa: تنظیم

source: Size
fa: اندازه

source: Other Size
fa: اندازه دیگر

source: resize
fa: تغییر اندازه

source: dock
fa: جایگاه

source: Docking
fa: جایگیری

source: Layer
fa: لایه

source: Program:
fa: برنامه:

source: list of program can changed
fa: لیست برنامه قابل تغییر

source: Directory:
fa: پوشه:

source: Directory:
fa: پوشه:

source: Pane is successful Update
fa: پنل با موفقیت به روز شد

source: Pane delete from application successful
fa: پنل با موفقیت از برنامه حذف شد

source: A new Pane add to application
fa: یک پنل جدید به برنامه اضافه شد

source: Please press Add bottom to make new pane
fa: لطفا کلید اضافه را برای پنل جدید فشار دهید

source: Double Program: Please Close Program Develop then Do this item
fa: تکرار برنامه:لطفا یکی از پنجره ها را ببندید سپس اجراء کنید

source: Cancel
fa: لغو

source: Ok
fa: تائید

source: Select database
fa: انتخاب دیتابیس

source: Select Database file
fa: فایل دیتابیس را انتخاب کنید

source: List of Tabel:
fa: لیست تیبل ها:

source: Type
fa: نوع

source: Insert
fa: جاگذاری

source: Join
fa: اتصال

source: Brows
fa: مرور

source: Generate
fa: تولید

source: Method in program
fa: متد در برنامه

source: Program Statments
fa: جملات برنامه

source: SQL Statments
fa: جمله SQL

source: Extended
fa: تمدید

source: Select Key feild
fa: کلید ارتباطی را مشخص کنید

source: Select Table
fa: تیبل را انتخاب کنید

source: Please connect to our site and send your request
fa: لطفا به سایت ما متصل شوید و درخواست خود را ارسال کنید

source: ok
fa: تائید

source: Key of Field UpDate
fa: کلید فیلد به روز شد

source: SomeData
fa: داده ها

source: Cancle or Return
fa: لغو یا برگشت

source: Ok or Apply
fa: تائید یا اجراء

source: Base Table For Join
fa: جدول پایه برای اتصال

source: Key of Field For Join
fa: فیلد کلیدی برای اتصال

source: Cancle & Return
fa: لغو و برگشت

source: Ok & Apply
fa: تائید و اجراء

source: List of Programs and Tools can download
fa: لیست برنامه های قابل دانلود

source: Preview
fa: پیش نمایش

source: UpDate
fa: بروز شده

source: Description
fa: توضیحات

source: Extract, Check and Show File
fa: استخراج، بررسی و نمایش فایل

source: To Directory
fa: به دایرکتوری

source: Select a folder
fa: یک پوشه را انتخاب کنید

source: Message
fa: پیغام

source: The file is in Zip file Please select new file!
fa: فایل در فایل فشرده است لطفا فایل جدید را انتخاب کنید!

source: Only file in Src Directory path send to zip file
fa: به فایل فشرده ارسال میشود Src Directory فقط فایل در مسیر

source: Please Change your path or select a correct path
fa: لطفا مسیر خود را تغییر دهید یا یک مسیر صحیح را انتخاب کنید

source: All file Successfull copy to Src path
fa: کپی شدند Src همه فایل ها با موفقیت در مسیر

source: We Pack tar file all file to Account path Do you like delete file ?
fa: ما فایل فشرده را در مسیر حساب بسته بندی می کنیم آیا دوست دارید فایل را حذف کنید؟

source: Type of Machin Learning
fa: نوع یادگیری ماشین

source: Learn Type
fa: نوع آموزش

source: Method
fa: متد

source: Select Data
fa: انتخاب داده

source: Conect Data
fa: اتصال به داده

source: Algorithm Pane Parameter
fa: صفحه پارامترهای الگوریتم

source: Algorithm already added
fa: الگوریتم اضافه شده

source: Your source Add to list Successfully.
fa: سورس به لیست اضافه شد

source: Please attend to coding range!
fa: لطفا به محدوده کدها توجه کنید

source: Some fields is empty or wrong ! try again!
fa: بعضی فیلدها خالی یا اشتباه هستند! دوباره تلاش کنید

source: Please Use <Generate> for create Panel
fa: لطفا از<Generate> برای ایجاد پنل استفاده کنید

source: Please Use <Apply> for add Algorithm file
fa: برای اضافه کردن الگوریتم استفاده کنید<Apply> لطفا از

source: Add MLA to List
fa: اضافه کردن الگوریتم به لیست

source: Alg. id
fa: الگوریتم نمره

source: Cancle
fa: لغو

source: List of menu:
fa: لیست منو:

source: Name Menu
fa: نام منو

source: Separator
fa: جدا کننده

source: MenuBar:
fa: منوبار

source: Code Generator
fa: تولید کد

source: Icon
fa: آیکون

source: Select a file
fa: انتخاب یک فایل

source: ShortCut
fa: میانبر

source: Status
fa: وضعیت

source: Disable
fa: غیر فعال

source: Hide
fa: مخفی

source: Normal
fa: معمولی

source: Check
fa: دکمه چک

source: Radio
fa: دکمه رادیوئی

source: Sub Menu
fa: زیرمنو

source: MenuBar:
fa: منوبار:

source: New Menu Bar
fa: منوبار جدید

source: Edit Menu Bar
fa: اصلاح منوبار

source: Delete Menu Bar
fa: حذف منوبار

source: Manage Directory
fa: مدیریت دایرکتوری

source: Some things wrong!
fa: چیزی اشتباهی وجود دارد

source: You can NOT edit Separator line
fa: جدا کننده قابل ویرایش نیست

source: Menu Edited Successfully
fa: منو با موفقیت ویرایش شد

source: Please remove the sub menu item first!
fa: لطفا اول زیر منو ها را حذف کنید

source: Please use Delete Menu Bar with right click on mouse
fa: لطفا برای حذف منوبار از راست کلید موس استفاده کنید

source: Add Successful Separator
fa: جداکننده با موفقیت اضافه شد

source: you successful add menu
fa: شما با موفقیت منو را اضافه کردید

source: Please Use Edit icon or first Add item
fa: لطفاً از نماد ویرایش یا اولین مورد افزودن استفاده کنید

source: Please Close Application Now!
fa: لطفا برنامه را بکلی ببندید

source: Note: To avoid duplicate code, pay attention to the correct format [991] [99az] The automatic code generation button helps you to create and generate new code [...] To create a new directory, just type its name at the end of the path after the slash You can use the same directories for multiple menu bars.
fa: توجه: برای جلوگیری از تکرار کد، به فرمت صحیح توجه کنید [991] [99az] دکمه تولید خودکار کد به شما کمک می کند کد جدید ایجاد و تولید کنید [...] برای ایجاد یک دایرکتوری جدید، فقط نام آن را در انتها تایپ کنید. از مسیر بعد از اسلش می توانید از همان دایرکتوری ها برای چندین نوار منو استفاده کنید.

source: Create
fa: ایجاد

source: Change
fa: تغییر

source: Change Menu Bar
fa: تغییر منوبار

source: Note : that by deleting the menu bar, all the items below it will also be removed Only the programs attached to the items will not be removed and the code will remain You can assign them to other items or create a new item .
fa: توجه: که با حذف نوار منو، تمامی موارد زیر آن نیز حذف می‌شوند، فقط برنامه‌های متصل به آیتم‌ها حذف نمی‌شوند و کد باقی می‌ماند، می‌توانید آنها را به موارد دیگر اختصاص دهید یا آیتم جدیدی ایجاد کنید.

source: Menu Bar and Access and Sub Item successfully Deleted
fa: منوبار و کد دسترسی و زیرمنو با موفقیت حذف شد

source: Bar name
fa: نام بار

source: Automatic code generate
fa: تولید کد اتوماتیک

source: Directory
fa: دایرکتوری

source: List of Directory and Path in Program
fa: لیست دایرکتوری ها و مسیرها در برنامه

source: Delete from HDD
fa: حذف از هارد دیسک

source: Delete Record
fa: حذف رکورد

source: Please selected one item you like to delete it
fa: لطفا یک آیتم را برای حذف انتخاب کنید

source: You can not delete this Directory, MenuBar is exist . If you want please delete MenuBar first.
fa: شما نمی توانید این دایرکتوری را حذف کنید،منوبار وجود دارد. لطفا اول منوبار را حذف کنید

source: Some program is exist in Hanlder . Please remove the programs from the list first and then the directory.
fa: بعضی برنامه ها در دیتا وجود دارد. لطفا اول برنامه های موجود را در لیست پاک کنید سپس دایرکتوری را حذف کنید

source: Do you want to delete this directory from HardDisk
fa: آیا میخواهید دایرکتوری را از هارد پاک کنید

source: Your Path in HardDisk is exist you can use it later
fa: مسیر شما در هاردیسک وجود دارد بعدا از آن استفاده کنید

source: List of Programs:
fa: لیست برنامه ها:

source: Program name
fa: نام برنامه

source: Description:
fa: توضیحات

source: Parameters
fa: پارامترها

source: Link:
fa: اتصالات:

source: Public it
fa: انتشار دهید

source: Database:
fa: دیتابیس:

source: Select Database Tabels and Fields for this program
fa: انتخاب جداول و فیلدهای دیتابیس برای این برنامه

source: Do you like delete program [%s] from HDD
fa: آیا میخواهید برنامه [%s]پاک شود

source: File Successfully Remove from HardDisk
fa: برنامه با موفقیت از روی هارد پاک شد

source: File Open or dose not exist please close it or check Harddisk
fa: فایل باز است یا وجود ندارد آن را ببندید یا هارد را چک کنید

source: Program successful delete from your list
fa: برنامه با موفقیت از لیست حذف شد

source: Please first Generate program then select the correct one to use it
fa: لطفا اول برنامه را تولید کنید سپس مورد صحیح را انتخاب کنید

source: Program Successfull add to list
fa: برنامه با موفقیت به لیست اضافه شد

source: You Forgot add main function! Please add it
fa: شما تابع اصلی را فراموش کردید آن را اضافه کنیدmain function

source: Please move your file to API directory or use correct form!
fa: لطفا فایل را به دایرکتوری APIمنتقل کنید یا از فرم درست استفاده کنید

source: You can only generate the unlisted program with end with this code '??'
fa: شما فقط میتوانید برنامه های لیست نشده را تولید کنید که با کد ؟؟ پایان یافته باشند

source: Create for Aui Pane
fa: ایحاد یک پنل متحرک Aui

source: name of file to create
fa: نام فایل ایجاد شده

source: choise path of file to create
fa: انتخاب مسیر فایل برای ایجاد

source: List of toolbar:
fa: لیست تولبار:

source: Toolbar Name
fa: نام تولبار

source: Seperator
fa: جداکننده

source: Group:
fa: گروه:

source: Code generator
fa: تولید کد

source: Short text
fa: متن کوتاه

source: Long text
fa: متن بلند

source: Type Toolbar
fa: نوع تولبار

source: Directory :
fa: دایرکتوری:

source: Please press Add button and then press [...] generator cod button. Group and cod NOT match
fa: لطفا دکمه اضافه و سپس ... دکمه تولید کد را فشار دهید . گروه و کد هماهنگ نیست

source: successful change Toolbar in program
fa: تولبار با موفقیت تغییر کرد

source: successful delete Toolbar at program
fa: تولبار با موفقیت از برنامه حذف شد

source: Please First Add 1 item then use line separator
fa: لطفا اول یک آیتم اضافه کنید بعد از جداکننده استفاده کنید

source: You must choose an image for tool, Please select a correct image.
fa: شما باید یک تصویر برای تول انتخاب کنید. لطفا تصویر درست را انتخاب کنید

source: Please fill the name ,id and access field, this fields must could not be empty.
fa: لطفا نام ای دی و کد دسترسی را پر کنید نباید خالی باشند

source: successful add Toolbar to program
fa: تولبار با موفقیت به برنامه اضافه شد

source: Please select toolbar or create it
fa: لطفا تولبار را برای ایجاد انتخاب کنید

source: Error In Menu Database. Please connect to Programmer
fa: خطا در دیتابیس منو لطفا با برنامه نویس تماس بگیرید

source: Menu Change
fa: تغییر منو

source: Toolbar Change
fa: تغییر نوارابزار

source: Panes Change
fa: تغییر صفحات پنل

source: Databases...
fa: دیتابیس ها ...

source: Programs...
fa: برنامه ها ...

source: Add Tools...
fa: ابزارهای اضافه ...

source: MLA Design...
fa: طراحی یادگیری ماشین ...

source: Settings...
fa: تنظیمات ...
